---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarShapeConstraintCircumference
source: html/1834e2d5-cc02-e1f3-3e17-8058593ff6f7.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeConstraintCircumference

A circumference constraint associated with an arc in a RebarShapeDefinition.

## Syntax (C#)
```csharp
public class RebarShapeConstraintCircumference : RebarShapeConstraint
```